# CurveNotEditableWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurveFailures..::..CurveNotEditableWarn Property
BuiltInFailures..::..CurveFailures Class See Also
---
Lines created by massing or picking 3d path are not editable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurveNotEditableWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveNotEditableWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurveNotEditableWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurveFailures Class
Autodesk.Revit.DB Namespace